app/views/problems/_form.html.haml

SELECT "sections".* FROM "sections"
SELECT "themes".* FROM "themes"
---
    = f.label :section
    = f.select :section_id, options_for_select(Section.all.map{|s| [s.id_and_title]}, :selected => problem.try(:section).try(:id_and_title))
  .field
    = f.label :theme
    = f.select :theme_id, options_for_select(Theme.all.map{|t| [t.id_and_title]}, :selected => problem.try(:theme).try(:id_and_title))
  .field