app/controllers/problems_controller.rb

  def index
    @problems = Problem.all
---
SELECT "problems".* FROM "problems"

  def create
    @problem = Problem.new(problem_params)

    respond_to do |format|
      if @problem.save
---
INSERT INTO "problems" ("theme_id", "category", "level", "content", "answer", "correct_counter", "created_at", "updated_at", "section_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @problem.update(problem_params)
---
UPDATE "problems" SET "section_id" = ?, "theme_id" = ?, "content" = ?, "updated_at" = ? WHERE "problems"."id" = ?  [["section_id", 1], ["theme_id", 1], ["content", "<p>\\(0\\leqq\\theta<2\\pi\\)の時,不等式\\(cos\\theta>-\\frac{1}{2}\\)を解け.</p>"], ["updated_at", 2016-07-20 08:32:28 UTC], ["id", 4]]

    def set_problem
      @problem = Problem.find(params[:id])
---
SELECT  "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]